--- a/zh_cn/chapter_00/workflow.md
+++ b/zh_cn/chapter_00/workflow.md
@@ -9,14 +9,24 @@ refen: welcome/workflow
 
 和其它的网络代理工具一样，你需要在一台配置了 V2Ray 的服务器，然后在自己的设备上安装 V2Ray 客户端，然后即可流畅地访问互联网。
 
-```mermaid
-graph LR;
-A(PC) -.- B(防火墙);
-B -.-> C(墙外网站);
-A --> D(V2Ray/VPS);
-D --> C;
-A --> E(墙内网站);
-```
+{% plantuml %}
+
+@startuml
+
+left to right direction
+
+(墙外网站) as (w1)
+(防火墙) as (w2)
+(V2Ray/VPS) as (VPS)
+
+(PC) --> (VPS)
+(VPS) --> (w1)
+(PC) .. (w2)
+(w2) ..> (w1)
+
+@enduml
+
+{% endplantuml %}
 
@@ -24,33 +34,32 @@ A --> E(墙内网站);
 
 如果你不想在每一台设备上都配置路由，你也可以设置一台中转服务器，用于接收客户端发来的所有流量，然后在服务器中进行转发判断。
 
-```mermaid
-graph LR;
-A(PC) -.-> B(防火墙);
-B -.-> C(墙外网站);
-A --> D(墙内VPS);
-D --> E(墙外VPS);
-E --> C
-D --> F(墙内网站);
-```
+{% plantuml %}
+
+@startuml
+
+left to right direction
+
+(墙外网站) as (w1)
+(防火墙) as (w2)
+(墙内网站) as (w3)
+(VPS1) as (v1)
+(VPS2) as (v2)
+
+(PC) --> (v1)
+(v1) --> (v2)
+(v2) --> (w1)
+(v1) --> (w3)
+(PC) .. (w2)
+(w2) ..> (w1)
+
+@enduml
+
+{% endplantuml %}
 
